cf/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПользователиИнтернет</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Партнеры</xr:Item>
				<xr:Item>Catalog.Грузополучатели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>(Общ) Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>(Регл) Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>(Регл) Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>(Общ) Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Comment>(Общ) Валюта, в которой хранятся денежные средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Comment>(Регл) Номер и дата разрешения открытия счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>(Общ) Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>(Общ) Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>(Общ) Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>(Общ) Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Bankleitzahl</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/БанковскиеСчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура НазначитьРеквизитыБанка(Значение, Банк, БИК, КоррСчет, Поле="")
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Банки") Тогда
		Банк = Значение;
	ИначеЕсли Поле = "Код" Тогда
		
		//Банк = Справочники.Банки.НайтиПоКоду(Значение);
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
		|ИЗ
		|	Справочник.Банки
		|ГДЕ
		|	Код = """ + Значение + """ И НЕ ПометкаУдаления
		|");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Банк = Выборка.Ссылка;
		Иначе
			Банк = Справочники.Банки.ПустаяСсылка();
		КонецЕсли;
	Иначе
		Банк = Справочники.Банки.НайтиПоРеквизиту(Поле, Значение);
	КонецЕсли;
		
	БИК		 = Банк.Код;
	КоррСчет = Банк.КоррСчет;
	
КонецПроцедуры


&НаКлиенте
Процедура БИКБанкаПриИзменении(Элемент)
	НазначитьРеквизитыБанка(БИКБанка, Объект.Банк, БИКБанка, КоррСчетБанка, "Код")
 КонецПроцедуры
&НаКлиенте
Процедура БИКБанкаДляРасчетовПриИзменении(Элемент)
	НазначитьРеквизитыБанка(БИКБанкаДляРасчетов, Объект.БанкДляРасчетов, БИКБанкаДляРасчетов, КоррСчетБанкаДляРасчетов, "Код")
 КонецПроцедуры
 &НаКлиенте
Процедура КоррСчетБанкаПриИзменении(Элемент)
	НазначитьРеквизитыБанка(КоррСчетБанка, Объект.Банк, БИКБанка, КоррСчетБанка, "КоррСчет")
 КонецПроцедуры
&НаКлиенте
Процедура КоррСчетБанкаДляРасчетовПриИзменении(Элемент)
	НазначитьРеквизитыБанка(КоррСчетБанкаДляРасчетов, Объект.БанкДляРасчетов, БИКБанкаДляРасчетов, КоррСчетБанкаДляРасчетов, "КоррСчет")
КонецПроцедуры
 &НаКлиенте
Процедура БанкПриИзменении(Элемент)
	НазначитьРеквизитыБанка(Объект.Банк, Объект.Банк, БИКБанка, КоррСчетБанка);
	Ответ = Вопрос("Сформировать новое наименование для счета?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура БанкДляРасчетовПриИзменении(Элемент)
	НазначитьРеквизитыБанка(Объект.БанкДляРасчетов, Объект.БанкДляРасчетов, БИКБанкаДляРасчетов, КоррСчетБанкаДляРасчетов);
КонецПроцедуры

&НаКлиенте
Функция СформироватьАвтоНаименование()
		
	СтрокаНаименования = ?(ЗначениеЗаполнено(Объект.Банк), Строка(Объект.Банк), "")
		+ " (" + Строка(Объект.ВалютаДенежныхСредств) + ")";
	СтрокаНаименования = Лев(СтрокаНаименования, 150);
	
	Возврат СтрокаНаименования;

КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;

КонецПроцедуры
